models/User.php

SELECT * FROM `user` WHERE `phone`='9111111111'
---
    public static function findByPhone($phone)
    {
        return static::findOne(['phone' => $phone]);